Repository: remram44/knock
Catalog: *.po
Languages: fr_fr

source: Coudldn't guess local hostname from SSH environment -- please use -l
fr_fr: Impossible de deviner l'adresse locale depuis l'environnement SSH -- merci d'utiliser -l

source: Option -s requires an argument
fr_fr: L'option -s requiert un argument

source: Option -s was specified more than once
fr_fr: L'option -s a été passée plusieurs fois

source: Option -r requires an argument
fr_fr: L'option -r requiert un argument

source: Option -r was specified more than once
fr_fr: L'option -r a été passée plusieurs fois

source: Option -l requires an argument
fr_fr: L'option -l requiert un argument

source: Option -l was specified more than once
fr_fr: L'option -l a été passée plusieurs fois

source: ssh arguments were not specified
fr_fr: Les arguments de ssh n'ont pas été indiqués

source: Couldn't guess remote hostname from SSH command -- please use -r
fr_fr: Impossible de deviner l'adresse distante depuis la commande SSH -- merci d'utiliser -r

source: Couldn't start the ssh process
fr_fr: Impossible de lancer le programme ssh

source: knock [options] [ports] [...] [user@host] [path/to/knock] Tests for port accessibility between here and the remote machine. Ports can have the format '42' or '41-47'; a '-' prefix means to test the local port from the remote side. Recognized options: -h Prints this help and exits -s <ssh_cmd> Sets the SSH binary (default: 'ssh') -r <hostname> Sets the hostname or address of the remote machine that we'll use to test remote ports -l <hostname> Sets the hostname or address of this machine that will be used by the remote to test local ports
fr_fr: knock [options] [ports] [...] [user@host] [chemin/vers/knock] Teste l'accessibilité des ports entre ici et la machine distante. Les ports peuvent avoir le format '42' ou '41-47'; un prefix '-' indique de tester le port local depuis la machine distante. Options reconnues : -h Affiche cette aide et termine -s <ssh_cmd> Change le binaire SSH (par défaut : 'ssh') -r <nom d'hôte> Définit le nom de domaine ou l'adresse de la machine distante qui sera utilisé pour tester les ports distants -l <nom d'hôte> Définit le nom de domaine ou l'adresse de cette machine qui sera utilisé par la machine distante pour tester les ports locaux

source: Error:
fr_fr: Erreur :

source: Couldn't lookup {hostname}
fr_fr: Impossible de résoudre {hostname}

source: Hostname {hostname} resolved to multiple addresses:
fr_fr: Le nom {hostname} a résolu en plusieurs adresses :

source: (selected)
fr_fr: (sélectionné)

source: Results for ports scanned on the remote machine:
fr_fr: Résultats pour les ports scannés sur la machine distante :

source: Results for ports scanned on the local machine:
fr_fr: Résultats pour les ports scannés sur la machine locale :

source: open
fr_fr: ouvert

source: closed
fr_fr: fermé

source: remote skipped
fr_fr: sauté par le serveur

source: local error
fr_fr: erreur locale

source: Port Status
fr_fr: Port Statut

source: Total: {open} open, {closed} closed
fr_fr: Total : {open} ouverts, {closed} fermés

source: Couldn't setup the Python path
fr_fr: N'a pas pu régler le path Python

source: Port sequence goes backwards: {0}-{1}
fr_fr: La séquence de ports est à l'envers : {0}-{1}

source: Port spec couldn't be parsed
fr_fr: Les ports n'ont pas été compris
